app/controllers/school_classes_controller.rb

    def update
        set_school_class
        @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Old"], ["room_number", 0], ["updated_at", "2020-04-08 01:49:00.315810"], ["id", 1]]