app/controllers/students_controller.rb

    def update
        @student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Johnson"], ["updated_at", "2020-04-08 03:32:51.092369"], ["id", 3]]